In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [8]:
obj = pd.Series([4, 7, -6, 2])
obj

0    4
1    7
2   -6
3    2
dtype: int64

In [11]:
obj.name="population"

In [12]:
obj = pd.Series([4, 7, -6, 2])
print(type(obj.values))
print(obj.values)

<class 'numpy.ndarray'>
[ 4  7 -6  2]

In [13]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [37]:
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-6), np.int64(2)]
Length: 4, dtype: int64

In [39]:
obj2 = pd.Series([5, 2, -5, 9], index=['d','b', 'a', 'c'])
obj2

d    5
b    2
a   -5
c    9
dtype: int64

In [40]:
obj2[['a', 'b', 'c', 'd']]

a   -5
b    2
c    9
d    5
dtype: int64

In [41]:
obj2[obj2>0]

d    5
b    2
c    9
dtype: int64

In [42]:
np.exp(obj2)

d     148.413159
b       7.389056
a       0.006738
c    8103.083928
dtype: float64

In [ ]:
# "in" index bo'yicha ishlaydi

'a' in obj2

True

In [5]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [45]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [6]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [48]:
# isna() berilgan obyektimizning qaysi joylarida NaN qiymati bor shuni tekshirib beradi

pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [49]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [7]:
obj4.name = "population"
obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [15]:
obj.index = ["Bob", "Stave", "Jeff", "Ryan"]
obj

Bob      4
Stave    7
Jeff    -6
Ryan     2
dtype: int64

                                                                          DataFrame
                                
DataFrame ni Series larni lug'at sifatida ko'rinishi

In [16]:
data = {"state" : ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

In [17]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
# "head" boshidan belgilaganimizcha chiqarib beradi 

frame.head(n=3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [19]:
# "tail" oxiridan belgilaganimizcha chiqarib beradi 

frame.tail(n=4)

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [20]:
# Ro'yxatlarni oshkor ko'rinishda berish

frame = pd.DataFrame(data, columns=['year', 'state', 'pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [21]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [22]:
# Qaysi ustunlar borligini bilish

frame.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [ ]:
# "loc" bizga qiymatlarni olishga yordam beradi

frame.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [25]:
frame.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      1.6
Name: 1, dtype: object

In [24]:
frame['debt'] = 1.6
frame

   year   state  pop  debt
0  2000    Ohio  1.5   1.6
1  2001    Ohio  1.7   1.6
2  2002    Ohio  3.6   1.6
3  2001  Nevada  2.4   1.6
4  2002  Nevada  2.9   1.6
5  2003  Nevada  3.2   1.6

In [26]:
frame['debt'] = np.arange(6.)
frame

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [27]:
len(frame)

6

In [28]:
val = pd.Series([2, 5, 6, 7, 4, 3])
frame['debt'] = val
frame

   year   state  pop  debt
0  2000    Ohio  1.5     2
1  2001    Ohio  1.7     5
2  2002    Ohio  3.6     6
3  2001  Nevada  2.4     7
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     3

In [29]:
val = pd.Series([20, 30, 40], index=[1,3,5])
frame['debt'] = val
frame

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7  20.0
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4  30.0
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2  40.0

In [30]:
frame['eastern'] = frame['state'] == 'Ohio'
frame

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7  20.0     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4  30.0    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2  40.0    False

In [31]:
del frame['eastern']
frame

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7  20.0
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4  30.0
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2  40.0

In [ ]:
# lug'at ichida lug'at bo'lganda
# bunda yillar index bo'lib qoladi

populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [ ]:
# Transformatsiya qilish: bunda ustunlar qatorga, qatorlar ustunga o'tib qoladi

frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [35]:
pd.DataFrame(populations, index=[2000, 2001, 2002, 2003])

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [38]:
pdata = {'Ohio': frame3["Ohio"][:-1], "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [40]:
frame3.index.name = 'Year'
frame3.index.name = 'State'
frame3

       Ohio  Nevada
State
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [39]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])